package config

// active only if contains at lest 1 item
var LocationPrefixWhitelist = []string{
	// //// следват метроро червената линия от центъра (без него) до края
	// "град София, Младост 4",
	// "град София, Малинова долина",
	// "град София, Младост 2",
	// "град София, Младост 3",
	// "град София, Младост 1",
	// "град София, Младост 1А",
	// "град София, Дианабад",
	// "град София, Изток",
	// "град София, Дървеница",
	// "град София, Мусагеница",
	// "град София, Изгрев",
	// "град София, Лозенец",
}

var LocationPrefixBlacklist = []string{
	"град София, Люлин",
	"град София, с. Мало Бучино",
	"град София, Орландовци",
	"град София, Студентски град",
	"град София, с. Лозен",
	"град София, Банишора",
	"град София, Овча купел",
	"град София, Карпузица",
	"град София, Обеля",

	//// izvun sofiq
	"град София, Бояна",
	"град София, м-т Гърдова глава",
	"град София, Суходол",
	"град София, с. ", // selo XYZ
	"град София, Ботунец",
	"град София, гр. Нови Искър",

	//// na sever ot centura
	"град София, Свобода",
	"град София, Левски",
	"град София, Модерно предградие",
	"град София, Надежда",
	"град София, Захарна фабрика",

	//// shit lokaciq (daleche tn)
	"град София, Горубляне",         // izglejda s ultra shit infrastruktura
	"град София, в.з.Врана - Лозен", // might as well da e izvun sofiq
}
