package define

// s kola, 8:30 AM
// град София, Гоце Делчев // 16-28min do rabota
// Овча купел 1 // 22-40min do rabota
// Дружба 1 // 14-30min

// active only if contains at lest 1 item
var LocationPrefixWhitelist = []string{
	// //// следват метроро червената линия от центъра до края
	// "град София, Младост 4",
	// // "град София, Малинова долина",
	// "град София, Младост 2",
	// "град София, Младост 3",
	// "град София, Младост 1",
	// "град София, Младост 1А",
	// "град София, Дианабад",
	// "град София, Изток",
	// "град София, Дървеница",
	// "град София, Мусагеница",
	// "град София, Изгрев",
	// "град София, Лозенец",
	// "град София, Център",

	//// specifichen kvartal
	// "град София, Дружба 1",
	// "град София, Младост 1",
	// "град София, Изток",
	// "град София, Изгрев",
	// "град София, Дианабад",
	// "град София, Център",
	// "град София, Мусагеница",
	// "град София, Дървеница",
	// "град София, Младост 4",
	// "град София, Младост 2",
	// "град София, Младост 3",
	// "град София, Зона Б-5",
	"град София, Зона Б-19",
}

var LocationPrefixBlacklist = []string{
	// "град София, Люлин",
	// // "град София, Орландовци",
	// // "град София, Студентски град",
	// // "град София, Овча купел",
	// // "град София, Карпузица",
	// // "град София, Обеля",

	// // 50/50 geto, moje bi po-malko cigani ot drujba
	// "град София, Банишора",

	// // geto
	// "град София, Орландовци",

	// // neudobno-ish za rabota
	// // "град София, Овча купел 2", // 22-40min s kola

	// //// izvun sofiq
	// "град София, Бояна",
	// "град София, м-т Гърдова глава",
	// "град София, Суходол",
	// "град София, с. ", // selo XYZ
	// "град София, Ботунец",
	// "град София, Филиповци",
	// "град София, Драгалевци",
	// "град София, Симеоново",
	// "град София, Витоша",
	// "град София, Княжево",
	// "град София, м-т Детски град",
	// "град София, гр. ", // grad XYZ
	// "град София, Карпузица",
	// "град София, в.з.Врана - Лозен", // might as well da e izvun sofiq
	// "град София, Горна баня",

	// //// na sever ot centura
	// "град София, Свобода",
	// "град София, Левски",
	// "град София, Модерно предградие",
	// "град София, Надежда",
	// "град София, Захарна фабрика",
	// "град София, Толстой",
	// "град София, Илиянци",
	// "град София, Света Троица",
	// "град София, Илинден",
	// "град София, Обеля",
	// "град София, Бенковски",
	// "град София, Връбница 1",
	// "град София, Връбница 2",
	// "град София, Връбница 1",

	// // //// nqma da mi e (super) odobno do rabota
	// // //// TODO: tova trqbva da go re-evaluate-na zashtoto namerih edin brutalen 106 kvadrata
	// // "град София, Красна поляна 3",
	// // "град София, Красна поляна 1", // + do fakulteta e
	// // "град София, Красна поляна 2", // + do fakulteta e
	// // "град София, Хладилника",
	// // "град София, Гоце Делчев", // eto tuk e tozi brutalniq 106 kvadrata
	// // "град София, Хаджи Димитър",
	// // "град София, Бъкстон",    // moje s X10 no toi e na 30min (ponqkoga pove4e)
	// // "град София, Разсадника", // 30min v metroto - ne e TOLKOVA zle actually
	// // "град София, Зона Б-18",  // 24min v metroto
	// // "град София, Лагера",

	// // //// shit lokaciq (daleche tn)
	// // "град София, Горубляне",         // izglejda s ultra shit infrastruktura
	// // "град София, в.з.Врана - Лозен", // might as well da e izvun sofiq
}
